#pragma once

#include "Engine/Math/matrix_types.h"

/**
 * @brief Хранит параметры движения SceneObject.
 *
 * MotionState содержит данные,
 * описывающие текущее движение объекта:
 *
 * - линейную скорость;
 * - угловую скорость;
 * - признак активности движения.
 *
 * Структура хранит только состояние
 * и не выполняет обновление Transform самостоятельно.
 */
struct MotionState {
	/**
	 * @brief Линейная скорость объекта.
	 *
	 * Компоненты X, Y и Z задают скорость движения
	 * вдоль соответствующих осей.
	 *
	 * По умолчанию объект не имеет
	 * линейного движения.
	 */
	Vec3 linear_velocity{
		0.0f,
		0.0f,
		0.0f
	};

	/**
	 * @brief Угловая скорость объекта.
	 *
	 * Компоненты X, Y и Z задают
	 * угловую скорость вращения
	 * вокруг соответствующих осей.
	 *
	 * По умолчанию вращение отсутствует.
	 */
	Vec3 angular_velocity{
		0.0f,
		0.0f,
		0.0f
	};

	/**
	 * @brief Определяет, активно ли движение объекта.
	 *
	 * По умолчанию значение равно false.
	 */
	bool enabled = false;
};