#pragma once

#include "../Math/matrix_types.h"

/**
 * @brief Хранит пространственное преобразование SceneObject.
 *
 * Transform описывает положение,
 * вращение и масштаб объекта.
 *
 * Структура содержит:
 *
 * - position — позицию объекта;
 * - rotation — углы вращения;
 * - scale — масштаб по трём осям.
 *
 * На основе этих данных может быть построена
 * Model Matrix, используемая для преобразования
 * локальных координат объекта в мировое пространство.
 */
struct Transform {
	/**
	 * @brief Позиция объекта.
	 *
	 * По умолчанию объект находится
	 * в начале координат:
	 *
	 * (0, 0, 0).
	 */
	Vec3 position{
		0.0f,
		0.0f,
		0.0f
	};

	/**
	 * @brief Вращение объекта.
	 *
	 * Компоненты X, Y и Z содержат
	 * углы вращения вокруг соответствующих осей.
	 *
	 * По умолчанию вращение отсутствует:
	 *
	 * (0, 0, 0).
	 */
	Vec3 rotation{
		0.0f,
		0.0f,
		0.0f
	};

	/**
	 * @brief Масштаб объекта.
	 *
	 * Компоненты X, Y и Z задают масштаб
	 * по соответствующим координатным осям.
	 *
	 * По умолчанию используется единичный масштаб:
	 *
	 * (1, 1, 1).
	 */
	Vec3 scale{
		1.0f,
		1.0f,
		1.0f
	};

	/**
	 * @brief Возвращает Model Matrix текущего Transform.
	 *
	 * Матрица строится на основе:
	 *
	 * - position;
	 * - rotation;
	 * - scale.
	 *
	 * Построение выполняется через
	 * AffineTransformation::ComposeModelMatrix().
	 *
	 * @return Model Matrix объекта.
	 */
	Matrix4 GetModelMatrix() const;
};