#pragma once

/**
 * @brief Определяет набор нагрузочных тестовых сцен Mini Engine.
 *
 * TestScene используется для выбора заранее определённой
 * конфигурации сцены с фиксированным количеством Cube.
 *
 * Нагрузочные сцены предназначены для тестирования
 * и сравнения производительности движка,
 * в том числе режимов:
 *
 * - ExecutionMode::SingleThreaded;
 * - ExecutionMode::MultiThreaded.
 *
 * Значения перечисления определяют требуемый
 * масштаб тестовой сцены.
 */
enum class TestScene {
	/**
	 * @brief Нагрузочная тестовая сцена не выбрана.
	 */
	None,

	/**
	 * @brief Тестовая сцена из 1 000 Cube.
	 */
	Cube1k,

	/**
	 * @brief Тестовая сцена из 10 000 Cube.
	 */
	Cube10k,

	/**
	 * @brief Тестовая сцена из 25 000 Cube.
	 */
	Cube25k,

	/**
	 * @brief Тестовая сцена из 50 000 Cube.
	 */
	Cube50k
};